tests/nockFixtures/MPagamento/pix-success.json

[
    {
        "scope": "https://api.mercadopago.com:443",
        "method": "POST",
        "path": "/v1/payments",
        "body": {
            "transaction_amount": 10.5,
            "description": "MERCADO PAGO PAGAMENTO PIX - Compra segura cliente heitoBVN@gmail.com",
            "payment_method_id": "pix",
            "external_reference": "25c2ff41-6f2e-4ad3-ab30-ccb2a2fa159a",
            "notification_url": "https://google.com.br/",
            "payer": {
                "email": "heitoBVN@gmail.com"
            }
        },
        "status": 201,
        "response": {
            "id": 1323180229,
            "date_created": "2024-05-13T23:25:28.584-04:00",
            "date_approved": null,
            "date_last_updated": "2024-05-13T23:25:28.584-04:00",
            "date_of_expiration": "2024-05-14T23:25:28.388-04:00",
            "money_release_date": null,
            "money_release_status": "released",
            "operation_type": "regular_payment",
            "issuer_id": "12501",
            "payment_method_id": "pix",
            "payment_type_id": "bank_transfer",
            "payment_method": {
                "id": "pix",
                "type": "bank_transfer",
                "issuer_id": "12501"
            },
            "status": "pending",
            "status_detail": "pending_waiting_transfer",
            "currency_id": "BRL",
            "description": "MERCADO PAGO PAGAMENTO PIX - Compra segura cliente heitoBVN@gmail.com",
            "live_mode": false,
            "sponsor_id": null,
            "authorization_code": null,
            "money_release_schema": null,
            "taxes_amount": 0,
            "counter_currency": null,
            "brand_id": null,
            "shipping_amount": 0,
            "build_version": "3.51.3",
            "pos_id": null,
            "store_id": null,
            "integrator_id": null,
            "platform_id": null,
            "corporation_id": null,
            "payer": {
                "identification": {
                    "number": null,
                    "type": null
                },
                "entity_type": null,
                "phone": {
                    "number": null,
                    "extension": null,
                    "area_code": null
                },
                "last_name": null,
                "id": "1638351316",
                "type": null,
                "first_name": null,
                "email": null
            },
            "collector_id": 512070603,
            "marketplace_owner": null,
            "metadata": {},
            "additional_info": {
                "available_balance": null,
                "nsu_processadora": null,
                "authentication_code": null
            },
            "order": {},
            "external_reference": "25c2ff41-6f2e-4ad3-ab30-ccb2a2fa159a",
            "transaction_amount": 10.5,
            "transaction_amount_refunded": 0,
            "coupon_amount": 0,
            "differential_pricing_id": null,
            "financing_group": null,
            "deduction_schema": null,
            "callback_url": null,
            "installments": 1,
            "transaction_details": {
                "payment_method_reference_id": null,
                "acquirer_reference": null,
                "net_received_amount": 0,
                "total_paid_amount": 10.5,
                "overpaid_amount": 0,
                "external_resource_url": null,
                "installment_amount": 0,
                "financial_institution": null,
                "payable_deferral_period": null,
                "bank_transfer_id": null,
                "transaction_id": null
            },
            "fee_details": [],
            "charges_details": [
                {
                    "id": "1323180229-001",
                    "name": "mercadopago_fee",
                    "type": "fee",
                    "accounts": {
                        "from": "collector",
                        "to": "mp"
                    },
                    "client_id": 0,
                    "date_created": "2024-05-13T23:25:28.588-04:00",
                    "last_updated": "2024-05-13T23:25:28.588-04:00",
                    "amounts": {
                        "original": 0.1,
                        "refunded": 0
                    },
                    "metadata": {},
                    "reserve_id": null,
                    "refund_charges": []
                }
            ],
            "captured": true,
            "binary_mode": false,
            "call_for_authorize_id": null,
            "statement_descriptor": null,
            "card": {},
            "notification_url": "https://google.com.br/",
            "refunds": [],
            "processing_mode": "aggregator",
            "merchant_account_id": null,
            "merchant_number": null,
            "acquirer_reconciliation": [],
            "point_of_interaction": {
                "type": "OPENPLATFORM",
                "business_info": {
                    "unit": "online_payments",
                    "sub_unit": "default",
                    "branch": "Merchant Services"
                },
                "location": {
                    "state_id": null,
                    "source": null
                },
                "application_data": {
                    "name": null,
                    "version": null
                },
                "transaction_data": {
                    "qr_code": "00020126580014br.gov.bcb.pix0136b76aa9c2-2ec4-4110-954e-ebfe34f05b61520400005303986540510.505802BR5911SA95657ZW426015S?fFxZ MHOUydk 62230519mpqrinter13231802296304D229",
                    "bank_transfer_id": null,
                    "transaction_id": null,
                    "e2e_id": null,
                    "financial_institution": null,
                    "ticket_url": "https://www.mercadopago.com.br/sandbox/payments/1323180229/ticket?caller_id=1638351316&hash=f4f0f5b1-48a9-4706-9abf-b919a5c1aa02",
                    "bank_info": {
                        "payer": {
                            "account_id": null,
                            "id": null,
                            "long_name": null,
                            "account_holder_name": null,
                            "identification": {
                                "number": null,
                                "type": null
                            },
                            "external_account_id": null
                        },
                        "collector": {
                            "account_id": null,
                            "long_name": null,
                            "account_holder_name": "Lujtk icVGgqza",
                            "transfer_account_id": null
                        },
                        "is_same_bank_account_owner": null,
                        "origin_bank_id": null,
                        "origin_wallet_id": null
                    },
                    "qr_code_base64": "iVBORw0KGgoAAAANSUhEUgAABWQAAAVkAQAAAAB79iscAAAI1ElEQVR42u3dQW7kNhAFUN2A97+lbqBgAiQjVX2y7WQQZKjXC8O2Wuyn3n1UsXhcv9HrPGhpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpf732qK/x43/j7wvj/r4ft9Y336+W943bJx4/F71ffVxIK9PS0tLS0tLS0tLS0u6vHffIdl8k8f5C/XnhfnXcFyiA+5vL93Dev6CsoqWlpaWlpaWlpaWlfYG2BMiSMVvaHPenKp9YHuh+4ZEi74uOJYOWlpaWlpaWlpaWlval2m8+wU9jrxuWYl97AlpaWlpaWlpaWlpaWtqQ5vLCvcSXXj/j5T0xpox5tKu0tLS0tLS0tLS0tLRv1CZ80ZbV2x0j9kvWxszFZrt/3CNKS0tLS0tLS0tLS0v7u2unU0r+2x//dqYKLS0tLS0tLS0tLS3tb6rNrzSlJM2CHLMUeR7zCmKq/S0ttLS0tLS0tLS0tLS0e2sn8yFbuBuLzsmU/9LgyGnDZdowR0tLS0tLS0tLS0tL+wptaXdsW9iO0DmZ6oFFVnLnFQZHPtJm3mxHS0tLS0tLS0tLS0v7Am3a27bYJjcW70tb5zJqUuz7PKWElpaWlpaWlpaWlpZ2Z20b6H/kONjuSBkzuXNErOeuhVIgLS0tLS0tLS0tLS3tztq0ZsY/VspXr3Y8dnvCR2Kc1hdpaWlpaWlpaWlpaWnfoy2xMVfyytX0QNOh/Ff4Ms58ZHbOqrS0tLS0tLS0tLS0tK/QplbJ9cdOMub9s9OAkuu5xa6MmsyzKmlpaWlpaWlpaWlpabfXtjH+k1pdK/EdoVZ3PJdK00yuNjOy3UZLS0tLS0tLS0tLS/sWbdr51gZC5mbII21mm66SniAV9pYpkpaWlpaWlpaWlpaWdj9t2592tvH8rRDX31weLV3NfZXpjmXXJS0tLS0tLS0tLS0t7X7aKxfd0oXp3P5W3ZsemZ222E2/G1paWlpaWlpaWlpa2pdpH5W8FPNKFbBsp8vT/ydz+9sHpW1ytLS0tLS0tLS0tLS079GOxbiRFgeve4ose+Vyxhxh+9v0WICDlpaWlpaWlpaWlpb2TdpWZbuWJbkRoNdiT12bQ5Lmn3yKobS0tLS0tLS0tLS0tHtrxzMYjjAzsshGHhKZvoI28ORjPv2QImlpaWlpaWlpaWlpabfUljEiuQkzTfWflu4KYOS4mmLo5xRJS0tLS0tLS0tLS0u7lTb1X7bfygyTvo+tHbm2PkDtyvNPWmmRlpaWlpaWlpaWlpb2LdqcIifPMkXlzskzXDjDtrsRvgJaWlpaWlpaWlpaWtr3aUvD5XSlT02Tj1e7d2RySpu0tLS0tLS0tLS0tLT7a8+2Z21Rl+udmGVS5D2GTp958r9UWqSlpaWlpaWlpaWlpd1d26bwl11p56dkmV8jd1OmKuD0XlpaWlpaWlpaWlpa2pdo+1a3PHH/aLExB8i0Skqq021353w3HC0tLS0tLS0tLS0t7X7afGD1ZM2yYa5dHbN4OZ59mpNNdCl80tLS0tLS0tLS0tLS7q9dfXbevdabNRcJ9GgpMhcPr/mYSlpaWlpaWlpaWlpa2r21faVUupu1Vx659XIyvuRT22YeP0lLS0tLS0tLS0tLS/sW7apfsuyfS1vnctPkNTsA+7qnzfufn7suaWlpaWlpaWlpaWlpt9L2SJdGSJZzrr8UPkslrzxpar1MUZKWlpaWlpaWlpaWlnZ3bR88UmSt3lb6NM9QziujJkuAPMOf17NZk5aWlpaWlpaWlpaW9lXaImuh8gqU3k35qdhX5kiO9lV9Z6YKLS0tLS0tLS0tLS3tPtprIUtjSVJETAl0+nyts3Pd6ElLS0tLS0tLS0tLS7u3dhobW8XvCkdXp2dJyXLkTXQ5O9LS0tLS0tLS0tLS0r5Meyy2uhVZWq61Xvb+yyLL2TG1Y9LS0tLS0tLS0tLS0r5Am2t16cS0Kw/qb82VxbgeSXnOjg8YtLS0tLS0tLS0tLS0b9ImY8mTJR2W39oR12dOkSmkpj+XKZKWlpaWlpaWlpaWlnZHbfH0rW6tsDcZ/ljITZFODuhHvX1IkbS0tLS0tLS0tLS0tBtp01606Y+2cNrMdoVT1EaeZtLqi5+m+tPS0tLS0tLS0tLS0u6nXdfgWkQsPZRXHjCZUmlu5ZwM9KelpaWlpaWlpaWlpX2PNlw8yrHXixPY+oCSaStnC5A9n35lpgotLS0tLS0tLS0tLe1u2pwJJ5NLUhFv/ZCpOzO3dy4enJaWlpaWlpaWlpaWdmftYlB/j4OpkXKRBAtvYmwFxYuWlpaWlpaWlpaWlvZN2jQ3JMfLnhinkbOEz/Zp6UknSZWWlpaWlpaWlpaWlnZ3bVuzN0iWNsvj+WpZ9Gh5Mo37b9P/r2cp8KKlpaWlpaWlpaWlpX2J9k5Opbv+VO3ctT6PP68yKfalAZMfekRpaWlpaWlpaWlpaWk30pYbpnvWyhjIRGlLpW8kDSM5w6T/i5aWlpaWlpaWlpaW9l3aIzRNjna11eXSadlH2z+XzgZo9cDvdF3S0tLS0tLS0tLS0tJupE2vxR64SRWw3bE+G2DyvvK10NLS0tLS0tLS0tLSvkI7jX5NMRZFvHWzZqnafeHez5mXlpaWlpaWlpaWlpZ2H23KequNcIuT1a7ZRMlSKDzzIW1fSZG0tLS0tLS0tLS0tLRbapc9j0dLeCltPl4hCR7pnOtFhB20tLS0tLS0tLS0tLS0q51qLUVOujNTWExnbn+nukdLS0tLS0tLS0tLS/sCbf+zhcrHZ6dZkLkeODlzO+FpaWlpaWlpaWlpaWnfo13gj8C7FkNG7n2VaVr/mePltIuTlpaWlpaWlpaWlpZ2f21vfGwJr3dTliSYh5FMq3vXLIaebToKLS0tLS0tLS0tLS3t7tr//4uWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaWlpaW9pdp/wB3PMK2RfEEeQAAAABJRU5ErkJggg=="
                }
            },
            "accounts_info": null,
            "tags": null
        },
        "rawHeaders": [
            "Date",
            "Tue, 14 May 2024 03:25:28 GMT",
            "Content-Type",
            "application/json;charset=UTF-8",
            "Transfer-Encoding",
            "chunked",
            "Connection",
            "close",
            "x-site-id",
            "MLB",
            "vary",
            "Accept,Accept-Encoding",
            "cache-control",
            "max-age=0",
            "etag",
            "e7d9dc4fe23b5eb8de07888a2da75765",
            "X-Content-Type-Options",
            "nosniff",
            "X-Request-Id",
            "d02bfba9-fa3e-4e28-a9ab-77307953b0ab",
            "X-XSS-Protection",
            "1; mode=block",
            "Strict-Transport-Security",
            "max-age=16070400; includeSubDomains; preload",
            "Access-Control-Allow-Origin",
            "*",
            "Access-Control-Allow-Headers",
            "Content-Type",
            "Access-Control-Allow-Methods",
            "PUT, GET, POST, DELETE, OPTIONS",
            "Access-Control-Max-Age",
            "86400",
            "Timing-Allow-Origin",
            "*"
        ]
    }
]